mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
/*
 * app_main.cpp
 *
 *  Created on: May 14, 2026
 *      Author: karadeli
 */

#include "globals.hpp"
#define DISABLE_CRC true
#define CHECK_TIMER_FREQUENCIES false


#include <shared_memory.h>
#include "app_main.hpp"
#include "main.h"
#include "i2c.h"
#include "spi.h"
#include "ring_buffer.h"
#include <string.h>
#include "task_timer.h"
#include "PressureSensor.hpp"
#include "globals.hpp"
#include "Button.hpp"
#include "string.h"
#include "UserTask.hpp"
#include "MissionUart.hpp"

#include "MissionControl.hpp"
//#include "platformController.h"

#include "BNO085.hpp"
#include "SdCard/sd_task.hpp"
//#include "SdCardRaw.hpp"
#include "nrf24.h"
#include "nrf24_link.h"
#include "nrf24_port.h"
BNO085 imu;

/* Plain (non-static) mirrors of the driver's internal counters, refreshed
 * every tick in tim7_trigger() - watch these in Live Expressions while
 * running. nrf24.c and nrf24_link.c each keep their own stats in a static
 * s_stats, same name in both files, which Live Expressions can't address
 * unambiguously by name; these globals sidestep that. */
nrf24_stats_t      nrf24_radio_stats;   /* per-fragment: tx_ok, tx_dropped, tx_timeout, rx_ok, retransmits, lost_packets */
nrf24_link_stats_t nrf24_frame_stats;   /* per-frame: frames_sent, frames_dropped, frags_sent, frames_rx, crc_errors, reassembly_drops */
uint32_t           nrf24_uplink_rx_count   = 0u;   /* ACK-payload uplink packets drained, see tim7_trigger() */
uint32_t           nrf24_uplink_bad_frames = 0u;   /* wrong length or CRC-16 mismatch, dropped                */
uint32_t           nrf24_uplink_dup_drops  = 0u;   /* repeat of an already-processed seq, ignored              */

/* Go/no-go: bit set = subsystem currently healthy. Recomputed every 100 ms in
 * LED_Counter_Tick(); MissionControl::Start() ANDs this against
 * missionControl.go_no_go_enabled to decide whether arming is allowed. */
uint8_t  go_no_go_status = 0u;
#define IMU_STALE_MS    200u   /* IMU reports at 200-400 Hz; way past one period if stale */
#define LIDAR_STALE_MS  300u   /* lidar repeats ~100/s per MissionUart.cpp's own estimate  */
static uint32_t s_last_imu_ok_tick   = 0u;
static uint32_t s_last_lidar_ok_tick = 0u;

/* Ground uplink command wire format -- MUST match rf24_gateway.py's CMD_*
 * opcodes / VERB table and CMD_STRUCT ("<BBIH" + crc16, little-endian).
 * Delivered as a raw nRF24 ACK payload (nrf24_rx_read() below), NOT our own
 * nrf24_link fragment format:
 *
 *   byte 0    seq       wraps at 256; gateway repeats a command 3x on the
 *                       same seq so one lost ACK payload doesn't lose it
 *   byte 1    cmd       opcode, see UPLINK_CMD_* below
 *   byte 2..5 echo_ts   last telemetry timestamp the gateway had seen (u32 LE)
 *   byte 6..7 arg       opcode-specific argument (u16 LE)
 *   byte 8..9 crc16     CRC-16/CCITT-FALSE seed 0xFFFF over bytes 0..7, LE
 */
#define UPLINK_CMD_LEN        10u
#define UPLINK_CMD_NOP        0x00u
#define UPLINK_CMD_SEL        0x10u
#define UPLINK_CMD_ARM        0x11u
#define UPLINK_CMD_START      0x12u
#define UPLINK_CMD_STOP       0x20u
#define UPLINK_CMD_ABORT      0x21u
#define UPLINK_CMD_DISCHARGE  0x30u
#define UPLINK_CMD_SHUTDOWN   0x40u
#define UPLINK_CMD_SET_GONOGO 0x50u   /* arg low byte = new go_no_go_enabled mask */

static bool    s_have_last_cmd_seq = false;
static uint8_t s_last_cmd_seq = 0;

/* Turn one validated uplink command into the same ASCII line HandleCommand()
 * already accepts over the mission UART, so the radio path gets every safety
 * check that already exists there for free -- most importantly that ARM/
 * START only fires if `arg` names the mission currently SELECTed, exactly
 * like typing "ARM HOVER" -- instead of re-implementing arm/fire logic in a
 * second, unvetted path. */
static void uplink_cmd_dispatch(uint8_t cmd, uint16_t arg)
{
	char line[40];
	char reply[64];

	switch (cmd) {
	case UPLINK_CMD_NOP:
		return;
	case UPLINK_CMD_SEL:
		snprintf(line, sizeof(line), "SEL %u", (unsigned)arg);
		break;
	case UPLINK_CMD_ARM:
	case UPLINK_CMD_START:
		if (arg >= missionTableCount) return;   /* out-of-range index, drop */
		snprintf(line, sizeof(line), "ARM %s", missionTable[arg].name);
		break;
	case UPLINK_CMD_STOP:
		snprintf(line, sizeof(line), "STOP");
		break;
	case UPLINK_CMD_ABORT:
		snprintf(line, sizeof(line), "ABORT");
		break;
	case UPLINK_CMD_DISCHARGE:
		snprintf(line, sizeof(line), "DISCHARGE");
		break;
	case UPLINK_CMD_SHUTDOWN:
		snprintf(line, sizeof(line), "SHUTDOWN");
		break;
	case UPLINK_CMD_SET_GONOGO:
		/* Doesn't move hardware, just changes what's allowed to gate a later
		 * ARM, so it skips the HandleCommand() ASCII round-trip -- there's no
		 * "repeat the name to confirm" style safety property to inherit here. */
		missionControl.go_no_go_enabled = (uint8_t)(arg & 0xFFu);
		printf("GONOGO enabled=0x%02X\r\n", missionControl.go_no_go_enabled);
		return;
	default:
		return;
	}

	reply[0] = '\0';
	missionControl.HandleCommand(line, reply, sizeof(reply));
	if (reply[0]) printf("%s", reply);
}


#define FRACTIONAL(x) int(floor(int((x)*100)))%100
#define LOG_TERMINATOR  0x0A0Du   /* LF,CR packed MSB-first */

//#define PI 3.1415926536f

// TODO: PS sensor 3 encodere yakin olan
// TODO: PS sensor 0 alttaki
void LED_Counter_Tick(void);


// TODO: islemci acilma sirasinda akim sensorlerini sifirlayacak.


volatile uint64_t micros_overflow=0;
float load;
//uint32_t local_sensor_data_dropped=0;



void current_adc_complete();
void encoder_adc_complete();
void pressure_adc_complete();

task_timer_t test_point_gpio = {5000,0};
task_timer_t button_task = {1,0};
task_timer_t IMU_task = {1,0};
task_timer_t sd_card_task = {500,0};
task_timer_t printf_task = {1, 0};
task_timer_t heartbeat_task = {100, 0}; // period ms, start ms

task_timer_t uart_logging = { 2, 0};
task_timer_t nrf24_tx_task = {20, 0};   // 50 Hz downlink

__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_current[5];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_encoder[8*4];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_pressure[6];

uint32_t timeOfLastPrint=uwTick;


DebouncedButton Button{1,BUTTON_USER_GPIO_PORT,BUTTON_USER_PIN};
DebouncedButton SafetyConnector{1,SAFETY_CONNECTOR_GPIO_Port,SAFETY_CONNECTOR_Pin};
volatile float load_filtered;
uint16_t crc16_calc(const uint8_t *p, size_t n);
bool mount_ok;
bool file_creation_ok;
float time_sec = 0;
int load_cell_counter = 0;

SensorData_t local_sensor_data{'K','D'};

