mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
    }
//    float R[3][3]; quatToR(q, R);
	if(lidar.hasNewReading()) {

		onLidarFrame(lidar.getDistance(), lidar.getStrength());
		s_last_lidar_ok_tick = uwTick;
	}
//    float aw[3];
//    for (int i = 0; i < 3; ++i)
//        aw[i] = R[i][0]*a_b[0] + R[i][1]*a_b[1] + R[i][2]*a_b[2];
    kf_profiler.end();


    if (task_ready(&heartbeat_task))
    	  		LED_Counter_Tick();
//    missionControl.HandleCommand(rx_line, reply, sizeof(reply))
    // TODO: recive handling

	tim7_profiler.end();
}

void tim12_trigger(){ // mid priority 50hz platform control task
	tim12_profiler.start();
//	platform_controller.rtU.Height = altEstimator.altitude(); // m
//	platform_controller.rtU.Velocity = altEstimator.velocity(); // m/s
	platform_controller.rtU.ManifoldPressure = Actuator::manifold->getBar(); // bar
	platform_controller.rtU.quaternion[0] = imu.gyroIntegratedRV.i;
	platform_controller.rtU.quaternion[1] = imu.gyroIntegratedRV.j;
	platform_controller.rtU.quaternion[2] = imu.gyroIntegratedRV.k;
	platform_controller.rtU.quaternion[3] = imu.gyroIntegratedRV.real;
	platform_controller.rtU.Height = g_altEst.height();
	platform_controller.rtU.Velocity = g_altEst.velocity();
//	platform_controller.rtU.T_alloc_total = T_alloc_total;


	float T_alloc_total  = 0;
	for (int i=0; i<4; i++) T_alloc_total += actuator[i].actuatorController.rtY.ThrustEstimate;
	float T_max_allowed  = 0;
	for (int i=0; i<4; i++) T_max_allowed += actuator[i].actuatorController.rtY.ThrustMax;

	platform_controller.rtU.T_alloc_total = T_alloc_total;
	platform_controller.rtU.T_max_allowed = T_max_allowed;

	// TODO: add drop, and force relationships.
//	platform_controller.rtU.Dropped = ;
	platform_controller.step();
	tim12_profiler.end();
}

void current_adc_complete(){
	adc2_profiler.start();
	for (int i=0; i<4; i++){
		actuator[i].updateCurrent(adc_dma_buf_current[i]);
	}
	for (int i=0; i<4; i++)
		actuator[i].current_controller_step();
	adc2_profiler.end();
}

void encoder_adc_complete(){
	adc1_profiler.start();
	for (int i=0; i<4; i++){
		actuator[i].updateHallEffect();
	}
	adc1_profiler.end();
}

void pressure_adc_complete(){
	adc3_profiler.start();
	for (int i=0; i<4; i++){
		actuator[i].readPressure();
	}
	Actuator::manifold->updatePS();
//	loadCell.update();

    missionControl.Iter();

//    altEstimator.setClamped(!missionControl.firing);   // was: !missionControl.running

//	altEstimator.setClamped(!missionControl.running);

	for (int i=0; i<4; i++) {
		actuator[i].actuator_controller_step();
	}
	// External inputs (root inport signals with default storage)
//	struct ExtU {
	//  real32_T P_manifold;             // '<Root>/P_manifold'
//	  real32_T P_nozzle_demand_ext;    // '<Root>/P_nozzle_demand_ext'
	//  real32_T P_nozzle;               // '<Root>/P_nozzle'
	//  real32_T SpeedFeedback;          // '<Root>/speed_feedback'
//	  real32_T pos_ref_ext;            // '<Root>/pos_ref_ext'
	//  real32_T pos_feedback;           // '<Root>/pos_feedback'
//	  real32_T speedDemand_ext;        // '<Root>/speedDemand_ext'
	//  real32_T ValveFitPressureRatios[11];// '<Root>/ValveFitPressureRatios'
//	  real32_T F_demand;               // '<Root>/F_demand'
	//  real32_T nozzle_gain;            // '<Root>/nozzle_gain'
//	};/

	// External outputs (root outports fed by signals with default storage)


	local_sensor_data.timestamp = micros(); //microseconds

	for (int j=0;j<4;j++){
		local_sensor_data.actuatorData[j].current_measured = actuator[j].get_current();
		local_sensor_data.actuatorData[j].current_demand = actuator[j].actuatorController.rtY.currentDemand;
		local_sensor_data.actuatorData[j].speedDemand = actuator[j].actuatorController.rtY.speedDemand;
		local_sensor_data.actuatorData[j].pos_ref = actuator[j].actuatorController.rtY.position_demand;
		local_sensor_data.actuatorData[j].pos_ref_rate_limited = actuator[j].actuatorController.rtY.pos_ref_rate_limited;
		local_sensor_data.actuatorData[j].speed_ref_rate_limited = actuator[j].actuatorController.rtY.speedDemand;
		local_sensor_data.actuatorData[j].pressure_demand = actuator[j].actuatorController.rtY.P_nozzle_demand1;
		local_sensor_data.actuatorData[j].valveAngle = actuator[j].hallEffect.valveAngle;
		local_sensor_data.actuatorData[j].valveAngleKalman = actuator[j].hallEffect.valveAngleKalman;
		local_sensor_data.actuatorData[j].valveVelocity = actuator[j].hallEffect.valveVelocity;
		local_sensor_data.actuatorData[j].duty = actuator[j].getDutyCycle();

		local_sensor_data.actuatorData[j].nozzle_pressure = actuator[j].getPressurePsi();
		local_sensor_data.actuatorData[j].nozzle_raw = *actuator[j].psSensor->raw_value;
		local_sensor_data.actuatorData[j].thrust_demand = actuator[j].actuatorController.rtU.F_demand;
		local_sensor_data.actuatorData[j].thrust_estimated = actuator[j].actuatorController.rtY.ThrustEstimate;

	}
//		local_sensor_data.thrust_measured = loadCell.getForce();
//		local_sensor_data.thrust_raw = *loadCell.raw_value;
		local_sensor_data.manifold_pressure = Actuator::manifold->getPsi();
		local_sensor_data.manifold_raw = *Actuator::manifold->raw_value;
		local_sensor_data.linearAccel = imu.accel;
		local_sensor_data.quaternion.i = imu.gyroIntegratedRV.i;
		local_sensor_data.quaternion.j = imu.gyroIntegratedRV.j;
		local_sensor_data.quaternion.k = imu.gyroIntegratedRV.k;
		local_sensor_data.quaternion.real = imu.gyroIntegratedRV.real;
		local_sensor_data.lidarDistance = lidar.getDistance();
		local_sensor_data.lidarStrength = lidar.getStrength();

		local_sensor_data.kf_altitude = g_altEst.height();
		local_sensor_data.kf_velocity = g_altEst.velocity();
//        float    innovation          = 0.0f;  /* last y = z - h        [m] */
//        float    nis                 = 0.0f;  /* last y^2 / S          [-] */
//        float    cosTilt             = 1.0f;  /* vertical fraction     [-] */
//        uint32_t lidarAccepted       = 0;
//        uint32_t lidarRejected       = 0;     /* gate or tilt failures     */
//        uint32_t lidarBlocksDropped  = 0;     /* too few valid raw frames  */
//        uint32_t consecutiveRejects  = 0;
//        bool     lastUpdateAccepted  = false;

		AltitudeEstimator::Status s = g_altEst.status();
//        local_sensor_data.kf_altitude   = altEstimator.altitude();
//        local_sensor_data.kf_velocity   = altEstimator.velocity();
//        local_sensor_data.kf_accelBias  = altEstimator.accelBias();
        local_sensor_data.kf_sigmaH     = g_altEst.heightSigma();
        local_sensor_data.kf_sigmaV     = g_altEst.velocitySigma();
        local_sensor_data.kf_meanNis    = s.nis;
        local_sensor_data.kf_tiltCos    = s.cosTilt;
        local_sensor_data.kf_rejects    = s.consecutiveRejects;

        local_sensor_data.actuator_mode = static_cast<uint8_t>(controller_mode);
        local_sensor_data.mission_modes = static_cast<uint8_t>(mission_mode);
        local_sensor_data.system_modes = static_cast<uint8_t>(missionControl.system_mode);
        local_sensor_data.last_error   = static_cast<uint8_t>(missionControl.last_error);
        local_sensor_data.go_no_go_status  = go_no_go_status;
        local_sensor_data.go_no_go_enabled = missionControl.go_no_go_enabled;
//        local_sensor_data.kf_flags      = (uint8_t)altEstimator.phase()
//                                        | (uint8_t)(altEstimator.lastResult() << 4);

		if(task_ready(&uart_logging)){
//			rb_write(&common_print_buffer, &local_sensor_data, (size_t)sizeof(SensorData_t));
		}

		if (missionControl.running and logData.ready) {
		    SensorData_t *slot = SensorData_Buffer_Reserve(&logData);
		if (slot){
			*slot = local_sensor_data;
			crc_profiler.start();
			slot->crc = crc16_calc((uint8_t*)slot, sizeof(SensorData_t) - 2);
			crc_profiler.end();
			SensorData_Buffer_Commit(&logData);
		}
	}

	adc3_profiler.end();
}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size){
	if (huart == &huart6){
//		lidar_profiler.start();
//		printf("aaaa lidar frame captured!\n\r");
		lidar.FrameHandler(Size);
//		if (lidar.hasNewReading()) altEstimator.onLidarFrame(lidar.getDistance(), lidar.getStrength());

		HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);  // re-arm!
//		lidar_profiler.end();
	}
}
void HAL_UART_ErrorCallback(UART_HandleTypeDef* huart) {
    if (huart == &huart6){
        HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);  // recover
    }
    if (huart == s_huart) {
        rb_tx_error_isr();
    }
    mission_uart_error(huart);        // no-op unless it is the command UART
}
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart == s_huart) {
		rb_tx_complete_isr();
	}
//	imu.quaternionInterval_us
}

static uint32_t lastUs = 0;
void onImuReport(const BNO085& r) {
    const uint32_t now = imu.accelInterval_us;
    const float dt = (lastUs == 0) ? 0.0f : (now - lastUs) * 1e-6f;
    lastUs = now;

    const float q[4] = { r.gyroIntegratedRV.real, r.gyroIntegratedRV.i, r.gyroIntegratedRV.j, r.gyroIntegratedRV.k };
    const float a[3] = { r.accel.x, r.accel.y, r.accel.z };
//    const float dt   = ( - lastTs_) * 1e-6f;
//    lastTs_ = r.quaternionInterval_us;
    g_altEst.pushImu(a, q, dt);
}
void onLidarFrame(uint16_t distMm, uint16_t strength) {
    const float q[4] = { imu.gyroIntegratedRV.real, imu.gyroIntegratedRV.i,
                         imu.gyroIntegratedRV.j,    imu.gyroIntegratedRV.k };
//    g_altEst.pushLidarFrame(distMm, strength, q);
    g_altEst.pushLidarFrame(distMm, strength, q);
}
void LED_Counter_Tick(void)
{
	static const uint8_t timing[] = {1, 0, 1, 0, 0, 0, 0};
	static const uint8_t timing_logging[]= {1, 0, 1, 0, 1, 0, 0};
	static uint8_t index = 0;
	if (logData.record){
		if (timing_logging[index])
			BSP_LED_On(LED_GREEN);
		else
			BSP_LED_Off(LED_GREEN);
		}
	else {
		if (timing[index])
			BSP_LED_On(LED_GREEN);
		else
			BSP_LED_Off(LED_GREEN);
	}

	/* Yellow: on whenever the downlink isn't demonstrably working right now --
	 * either it just dropped a frame (frames_dropped ticking up) or nothing
	 * went out at all since the last check (frames_sent stalled -- covers a
	 * dead/hung radio that never even gets far enough to hit a retry-exhausted
	 * drop). Off only while frames are actually leaving clean. */
	static uint32_t lastFramesSent = 0;
	static uint32_t lastFramesDropped = 0;
	bool sentProgress = (nrf24_frame_stats.frames_sent != lastFramesSent);
	bool droppingNow  = (nrf24_frame_stats.frames_dropped != lastFramesDropped);
	lastFramesSent    = nrf24_frame_stats.frames_sent;
	lastFramesDropped = nrf24_frame_stats.frames_dropped;

	if (sentProgress && !droppingNow)
		BSP_LED_Off(LED_YELLOW);
	else
		BSP_LED_On(LED_YELLOW);

	/* Go/no-go: recompute which of the 6 gated subsystems are currently
	 * healthy. See MissionControl::Start(), which ANDs this against
	 * missionControl.go_no_go_enabled before allowing an arm. */
	{
		uint8_t status = 0;

		if ((uwTick - s_last_imu_ok_tick) < IMU_STALE_MS)
			status |= GoNoGo::IMU;
		if ((uwTick - s_last_lidar_ok_tick) < LIDAR_STALE_MS)
			status |= GoNoGo::LIDAR;

		bool pressure_ok = true;
		for (int i = 0; i < 5; i++)
			if (adc_dma_buf_pressure[i] < 4000) pressure_ok = false;
		if (pressure_ok) status |= GoNoGo::PRESSURE;

		if (logData.ready) status |= GoNoGo::SD_CARD;

		if (sentProgress && !droppingNow) status |= GoNoGo::TELEMETRY;

		bool current_ok = true;
		for (int i = 0; i < 4; i++)
			if (adc_dma_buf_current[i] < 4000) current_ok = false;
		if (current_ok) status |= GoNoGo::CURRENT;

		go_no_go_status = status;
	}

	index ++;
	index %= 7;
}

uint16_t crc16_calc(const uint8_t *p, size_t n)
{
#ifdef DISABLE_CRC
	return LOG_TERMINATOR;
//	return (uint16_t) '\n\r';
#else
    CRC->CR |= CRC_CR_RESET;               // reload INIT (0xFFFF), self-clears
    while (n--)
        *(volatile uint8_t *)&CRC->DR = *p++;   // STRB: byte-wide feed
    return (uint16_t)CRC->DR;
#endif
}
